<!-- terraform-plan-comment -->
### 📦 Terraform Plan Result
```
data.aws_availability_zones.available: Reading...
aws_vpc.k8s: Refreshing state... [id=vpc-086e52a33a864ff2e]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
aws_internet_gateway.k8s: Refreshing state... [id=igw-02524fe0cc2fa7c0a]
aws_subnet.public[0]: Refreshing state... [id=subnet-03db3655b617f6817]
aws_subnet.public[1]: Refreshing state... [id=subnet-091c91645e010625b]
aws_subnet.public[2]: Refreshing state... [id=subnet-0e00b538d8010a536]
aws_security_group.k8s: Refreshing state... [id=sg-01bf9bc28bfba67cd]
aws_route_table.k8s: Refreshing state... [id=rtb-0bd02e70a9a3f5884]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d3b36ef6c734995b]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-09cd4354b96a4dbdd]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07b4e6a9230757cb9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.master_node_iam.aws_iam_instance_profile.master_node_ec2_instance_profile will be created
  + resource "aws_iam_instance_profile" "master_node_ec2_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "master-node-role-profile"
      + path        = "/"
      + role        = "master-node-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.master_node_iam.aws_iam_role.master_node_ec2 will be created
  + resource "aws_iam_role" "master_node_ec2" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "master-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.master_node_iam.aws_iam_role_policy.master_node_ec2_policy will be created
  + resource "aws_iam_role_policy" "master_node_ec2_policy" {
      + id     = (known after apply)
      + name   = "master-node-role-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::k8s-bootstrap-artifacts/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```